app/Controllers/AuthController.php

    public function store() {

        $validation = \Config\Services::validation();
        $validator = [
            'first_name'           => 'required|min_length[2]|max_length[50]',
            'middle_name'          => 'permit_empty|min_length[1]|max_length[50]',
            'last_name'            => 'required|min_length[2]|max_length[50]',
            'username'             => 'required|is_unique[users.username]',
            'password'             => 'required|min_length[6]',
            'confirm_password'     => 'matches[password]'
        ];


        if (!$this->validate($validator)) {
            return redirect()->to('/register')->withInput()->with('errors', $this->validator->getErrors());
        }


        $userModel = new UserModel();
        $userData = [
            'first_name'      => $this->request->getPost('first_name'),
            'middle_name'     => $this->request->getPost('middle_name'),
            'last_name'       => $this->request->getPost('last_name'),
            'username'           => $this->request->getPost('username'),
            'password'        => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
        ];

        if ($userModel->save($userData)) {
---
INSERT INTO `users` (`first_name`, `middle_name`, `last_name`, `username`, `password`, `created_at`, `updated_at`) VALUES ('Jerico ', 'KYO', 'POBADORA', 'KYO-CODE', '$2y$10$E0UUYGt0VcCjF8hTliU1sOH8TB08vpWhzT.pAbb3/24NTvSDQ4bjW', '2025-06-09 06:15:48', '2025-06-09 06:15:48')

    public function authenticate() {

        $session = session();
        $userModel = new UserModel();


        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');


        if (!$this->validate([
            'username'    => 'required',
            'password' => 'required|min_length[6]'
        ])) {
            return redirect()->to('/login')->withInput()->with('errors', $this->validator->getErrors());
        }


        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'eko-123'
 LIMIT 1